src/Reports/ВзаиморасчетыПодробно.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ВзаиморасчетыПодробно</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/Reports/ВзаиморасчетыПодробно/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Контрагент") Тогда 
		Отчет.Контрагент = Параметры.Контрагент;
	КонецЕсли;
	
	ВывестиОтчет();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды "Сформировать"
//
Процедура Сформировать(Команда)
	
	ВывестиОтчет();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура, формирует отчет
//
Процедура ВывестиОтчет()
	
	Отчеты.ВзаиморасчетыПодробно.ВывестиАктОбОказанныхУслугах(Отчет.Контрагент, Отчет.СтруктурнаяЕдиница, ТабличныйДокумент, НачалоПериода, КонецПериода);
	
КонецПроцедуры

#КонецОбласти
